# 4장 조인튜닝

## 4.1 NL 조인
### 4.1.1 기본 메커니즘
### 4.1.2 NL조인 실행계획 제어
### 4.1.3 NL조인 수행 과정 분석
### 4.1.4 NL조인 튜닝 포인트
### 4.1.5 NL조인 튜닝 요약
### 4.1.6 NL조인 튜닝 실습
### 4.1.7 NL조인 확장 메커니즘

## 4.2 소트 머지 조인
### 4.2.1 SGA vs. PGA
### 4.2.2 기본 메커니즘
### 4.2.3 소트 머지 조인이 빠른 이유
### 4.2.4 소트 머지 조인의 주용도
### 4.2.5 소트 머지 조인 제어하기
### 4.2.6 소트 머지 조인 특징 요약

## 4.3 해시 조인
### 4.3.1 기본 메커니즘
### 4.3.2 해시 조인이 빠른 이유
### 4.3.3 대용량 Built Input 처리
### 4.3.4 해시 조인 실행계획 제어
### 4.3.5 조인 메소드 선택 기준

## 4.4 서브쿼리 조인
### 4.4.1 서브쿼리 변환이 필요한 이유
### 4.4.2 서브쿼리와 조인
### 4.4.3 뷰(View)와 조인
### 4.4.4 스칼라 서브쿼리 조인
